run/wall/fluid/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(

    (0 .5 0)
    (5 .5 0)
    (5 1. 0)
    (0 1. 0)
    
    (0 .5 1)
    (5 .5 1)
    (5 1. 1)
    (0 1. 1)
    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 20 1) simpleGrading (1 10 1)
);

edges
(
);

boundary
(

    inlet
    {
        type wall;
        faces
        (
        	(4 7 3 0)
        );
    }
    
    outlet
    {
        type wall;
        faces
        (
        	(1 2 6 5)
        );
    }
    
    top
    {
        type wall;
        faces
        (
        	(7 6 2 3)
        );
    }
    
    interface
    {
        type wall;
        faces
        (
        	(4 0 1 5)
        );
    }
    
);

mergePatchPairs
(
);

// ************************************************************************* //
