run/wall/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       1540;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       1560;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       1580;
    }
    interface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       1620;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1600;
        startFace       1660;
    }
)

// ************************************************************************* //
