run/wall/fluid/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel	Newtonian;


// Laminar viscosity
nu              nu [ 0 2 -1 0 0 0 0 ] 1e-5;

// Thermal expansion coefficient
beta 			beta [0 0 0 -1 0 0 0] 3e-03;

// Reference temperature
TRef            TRef [0 0 0 1 0 0 0] 300;

// Laminar Prandtl number
Pr				Pr [0 0 0 0 0 0 0] 0.9;

// Turbulent Prandtl number
Prt				Prt [0 0 0 0 0 0 0] 0.7;


// ************************************************************************* //
